import { FC } from 'react';

const RulesPage: FC = () => {
  return (
    <div className="px-10 my-20">
      <h1 className="text-[40px] text-secondary font-semibold leading-9 mb-10">
        Угода користувача
      </h1>
      <p className="text-lg  leading-6 text-text_com mb-8">
        Я (надалі – «Я» та/або «Користувач») погоджуюсь з умовами цієї Угоди
        користувача і, використовуючи сайт: farmer`s_market.com.ua (надалі –
        «Сайт») при замовленні, листуванні, телефонній розмові, залишенні
        відгуків тощо, надаю згоду на обробку і захист своїх персональних даних,
        як Користувача, в обсязі, порядку, відповідно до мети обробки згідно з
        Положенням про обробку персональних даних, розміщеному тут: (надалі –
        «Положення» та/або «Положення про обробку і захист персональних даних»).
      </p>
      <h2 className="text-2xl text-text_com font-semibold mb-4">
        Персональні дані
      </h2>
      <p className="text-lg  leading-6 text-text_com mb-8">
        У доповнення до Положення, на виконання вимог Закону України "Про захист
        персональних даних" шляхом заповнення на Онлайн-платформі заявки для
        розгляду можливості придбання товару в кредит та натискання кнопки
        «Замовлення підтверджую» даю згоду на обробку вказаних у заявці моїх
        персональних даних
      </p>
      <h2 className="text-2xl text-text_com font-semibold mb-4">
        Поняття і визначення
      </h2>
      <p className="text-lg  leading-6 text-text_com mb-8">
        У цій оферті, якщо контекст не вимагає іншого, наведені нижче терміни
        мають таке значення: «Товар» – перелік найменувань асортименту,
        представлений в інтернет-магазині. «Інтернет-магазин» – відповідно до
        Закону України «про електронну комерцію», засіб для подання або
        реалізації товару, роботи або послуги шляхом здійснення електронної
        угоди. «Сайт» –www.farmer`s_market.com.ua «Продавець» – компанія, яка
        реалізує товари, представлені на Інтернет-сайті. «Покупець» – фізична
        особа, що уклала з Продавцем Договір на умовах, викладених нижче.
        «Замовлення» – вибір окремих позицій з переліку товарів, зазначених
        Покупцем при розміщенні замовлення і проведенні оплати.
      </p>
      <h2 className="text-2xl text-text_com font-semibold mb-4">
        Предмет договору
      </h2>

      <p className="text-lg  leading-6 text-text_com ">
        Цей Договір регулює купівлю-продаж товарів в Інтернет-магазині, в тому
        числі:
      </p>
      <ul className="list-disc mb-8 pl-6 text-lg  leading-6 text-text_com">
        <li>
          <p>добровільний вибір Покупцем товарів в Інтернет-магазині;</p>
        </li>
        <li>самостійне оформлення Покупцем замовлення в Інтернет-магазині;</li>
        <li>
          підтвердження досягнення 18-річного віку при замовленні алкогольних
          товарів;
        </li>
        <li>оплата Покупцем замовлення, оформленого в Інтернет-магазині;</li>
        <li>
          обробка і доставка замовлення Покупцеві у власність на умовах цього
          Договору.
        </li>
      </ul>
      <h2 className="text-2xl text-text_com font-semibold mb-4">
        Порядок оформлення замовлення
      </h2>
      <ul className="list-decimal mb-8 pl-6 text-lg  leading-6 text-text_com">
        <li>
          Покупець має право оформити замовлення на будь-який товар,
          представлений на Сайті Інтернет-магазину і наявний.
        </li>
        <li>
          Покупець має право оформити замовлення на алкогольний товар за умови
          підтвердження свого віку (від 18 років).
        </li>
        <li>
          Замовлення Покупця оформлюється відповідно до процедур, зазначених на
          Сайті Інтернет-магазин через додавання Товару в «Кошик» і кнопку
          «Оформити замовлення».
        </li>
        <li>
          Кожна позиція може бути представлена в замовленні в будь-якій
          кількості.
        </li>
        <li>
          При відсутності товару на складі Продавець зобов’язаний повідомити про
          це Покупця (по телефону, електронну пошту або будь-яким іншим каналом
          зв’язку).
        </li>
        <li>
          При відсутності товару Покупець має право замінити його товаром
          аналогічної моделі, відмовитися від даного товару, анулювати
          замовлення.
        </li>
        <li>
          Покупець несе відповідальність за достовірність даних, зазначених при
          оформленні замовлення товару, в тому числі стосовно свого віку при
          купівлі алкогольних товарів.У випадку, якщо неправильне, неточне
          та/або неправильне зазначення даних в Замовленні призвело до
          додаткових витрат Продавця, пов’язаних з доставкою товару по невірній
          адресі або видачу товару невірному Одержувачу, всі пов’язані з цим
          збитки та витрати покладаються на Покупця. Продавець має право
          стягувати суму таких збитків або витрат із сум, сплачених Платником в
          якості оплати товару. Покупець зобов’язаний надати про себе всю
          необхідну інформацію для здійснення електронної угоди.
        </li>
      </ul>
      <h2 className="text-2xl text-text_com font-semibold mb-4">
        Права та обов’язки сторін
      </h2>
      <ul className="list-decimal mb-8 pl-6 text-lg  leading-6 text-text_com">
        <li>
          Продавець має право:
          <ul className="list-disc pl-6  ">
            <li>
              В односторонньому порядку припинити надання послуг за цим
              договором у разі порушення Покупцем умов цього договору.
            </li>
          </ul>
        </li>
        <li>
          Покупець зобов’язаний:
          <ul className="list-disc pl-6  ">
            <li>
              В односторонньому порядку припинити надання послуг за цим
              договором у разі порушення Покупцем умов цього договору.
            </li>
            <li>
              Своєчасно оплатити та отримати замовлення на умовах цього договору
            </li>
            <li>
              Не здійснювати Замовлення від імені або замість іншої особи без їх
              згоди
            </li>
            <li>
              Не завантажувати/зберігати/публікувати/поширювати або іншим чином
              використовувати віруси та інші шкідливі програми по відношенню до
              Сайту Інтернет-магазину;
            </li>
            <li>
              Не відтворювати, не дублювати, копіювати, продавати, здійснювати
              торгові операції і перепродавати послуги та/або товари для
              будь-яких цілей, за винятком випадків, коли такі дії були прямо
              дозволені Покупцеві у відповідності з даною офертою;
            </li>
            <li>
              Не завантажувати на Сайт Інтернет-магазину матеріал, захищений
              авторським правом, торгові марки чи іншу приватну інформацію без
              отримання попередньої згоди власника інтелектуальної власності.
            </li>
            <li>
              Не використовувати програмне забезпечення та здійснювати дії,
              направлені на порушення нормального функціонування Сайту
              Інтернет-магазинуі його сервісів;
            </li>
            <li>
              не завантажувати, зберігати, публікувати, поширювати і надавати
              доступ або іншим чином використовувати будь-яку інформацію, яка
              порушує Правила розміщення текстів Сайту Інтернет-магазину,які є
              невід’ємною частиною цієї оферти;
            </li>
            <li>
              не змінювати, налаштовувати, переводити або створювати похідні
              продукти, засновані на Сайті Інтернет-магазинуі елементах
              Бібліотеки, а також інтегрувати Сайт або елементи Бібліотеки в
              інші результати інтелектуальної діяльності;
            </li>
            <li>
              не робити дій, які можуть розглядатися як ті, що порушують
              українське законодавство або норми міжнародного права, в тому
              числі в сфері інтелектуальної власності, авторських і / або
              суміжних правах, а також будь-яких дій, які призводять або можуть
              призвести до порушення нормальної роботи Сайту і сервісів сайту.
            </li>
          </ul>
        </li>
        <li>
          Покупець має право:
          <ul className="list-disc pl-6 ">
            <li>оформити замовлення в Інтернет-магазині;</li>
            <li>оформити електронний договір;</li>
            <li>вимагати від Продавця виконання умов цього Договору.</li>
          </ul>
        </li>
      </ul>

      <h2 className="text-2xl text-text_com font-semibold mb-4">
        Відповідальність сторін
      </h2>
      <ul className="list-decimal mb-8 pl-6 text-lg  leading-6 text-text_com">
        <li>
          Сторони несуть відповідальність за невиконання або неналежне виконання
          умов цього договору в порядку, передбаченому цим договором та чинним
          законодавством України.
        </li>
        <li>
          Продавець не несе відповідальності за:
          <ul className="list-disc pl-6">
            <li>змінений виробником зовнішній вигляд Товару;</li>
            <li>
              за незначну невідповідність колірної гами товару, що може
              відрізнятися від оригіналу товару виключно через різній колірній
              передачі моніторів персональних комп’ютерів окремих моделей;
            </li>
            <li>
              за зміст і правдивість інформації, наданої Покупцем при оформленні
              замовлення;
            </li>
            <li>
              за затримку і перебої в наданні Послуг (обробки замовлення та
              доставки товару), які відбуваються з причин, що знаходяться поза
              сферою його контролю;
            </li>
            <li>
              за протиправні незаконні дії, здійснені Покупцем за допомогою
              даного доступу до мережі Інтернет;
            </li>
            <li>
              за передачу Покупцем своїх мережевих ідентифікаторів – IP,
              MAC-адреси, логіна і пароля третім особам;
            </li>
            <li>
              шкоду, заподіяну Покупцеві внаслідок неналежного використання
              придбаних ним Товарів.
            </li>
            <li>
              за неякісне виконання або невиконання своїх зобов’язань у зв’язку
              з неактуальністю інформації про Покупця або її невідповідністю
              дійсності.
            </li>
            <li>
              ми доклали всіх зусиль, щоб показати зовнішній вигляд нашої
              продукції настільки точно і правдиво, наскільки це можливо і є в
              реальному житті. В данному випадку ми говоримо про кольори,
              смакові характеристики, описи, розмір продукції тощо. Ми можемо
              час від часу змінювати характеристики продуктів, які
              відображаються на нашому сайті, без попереднього інформування
              користувачів.
            </li>
          </ul>
        </li>
        <li>
          Покупець, використовуючи наданий йому доступ до мережі Інтернет,
          самостійно несе відповідальність за шкоду, заподіяну його діями
          (особисто, навіть якщо під його логіном знаходилося іншу особу) особам
          або їх майну, юридичним особам, державі чи моральним принципам
          моральності.
        </li>
        <li>
          У разі настання обставин непереборної сили, сторони звільняються від
          виконання умов цього договору. Під обставинами непереборної сили для
          цілей цього договору розуміються події, що мають надзвичайний,
          непередбачений характер, які виключають або об’єктивно заважають
          виконанню цього договору, настання яких Сторони не могли передбачити і
          запобігти розумними способами.
        </li>
        <li>
          Сторони прикладають максимум зусиль для вирішення будь-яких
          розбіжностей виключно шляхом переговорів, у разі недосягнення угоди
          суперечка буде передана на розгляд до судового органу відповідно до
          чинного законодавства України.
        </li>
        <li>
          Приймаючи умови угоди, Користувач підтверджує, що він є право – та
          дієздатною, а також що у нього відсутні які-небудь обмеження в
          дієздатності.
        </li>
      </ul>

      <h2 className="text-2xl text-text_com font-semibold mb-4">
        Термін дії договору
      </h2>
      <ul className="list-decimal mb-8 pl-6 text-lg  leading-6 text-text_com">
        <li>
          До закінчення терміну дії цей Договір може бути розірваний за взаємною
          згодою сторін до моменту фактичної доставки товару, шляхом повернення
          грошових коштів.
        </li>
        <li>
          Сторони мають право розірвати цей договір в односторонньому порядку, в
          разі невиконання однією із сторін умов цього Договору та у випадках
          передбачених чинним законодавством України.Звертаємо вашу увагу, що
          інтернет-магазин « Farmer`s market» на офіційному інтернет-сайті
          https://www.farmer`s_market.com.ua, має право, відповідно до
          законодавства України, надавати право користування інтернет платформою
          ФОП і юридичним особам для реалізації товару.
        </li>
      </ul>
      <h2 className="text-2xl text-text_com font-semibold mb-4">
        Авторські права
      </h2>
      <ul className="list-decimal mb-8 pl-6 text-lg  leading-6 text-text_com">
        <li>
          Всі авторські права, права на бази даних, товарні знаки (включаючи
          https://www.farmer`s_market.com.ua) і всі інші права на інтелектуальну
          власність на даному веб-сайті, такі як тексти, графіка, логотипи,
          банери, зображення, кнопки, які лежать в основі вихідного коду і
          програмного забезпечення, є виключно власністю компанії Farmer`s
          market.
        </li>
        <li>
          Будь-яке використання (включаючи копіювання, відтворення, передача і
          відображення вмісту даного веб-сайту) без спеціального письмового
          дозволу Farmer`s market , окрім перегляду інформації або замовлення
          товарів, суворо заборонено.
        </li>
      </ul>

      <h2 className="text-2xl text-text_com font-semibold mb-4">
        Правила й умови заміни товарів
      </h2>
      <ul className="list-decimal mb-8 pl-6 text-lg  leading-6 text-text_com">
        <li>
          Компанія залишає за собою право замінити будь-який елемент , ніж
          оригінал або відмінити замовлення при відсутності одного з елементів.
        </li>
        <li>
          В таких випадках ми докладемо всі зусилля, щоб проінформувати Вас про
          можливу заміну. Також, ми гарантуємо, що при заміні, ми зробимо все
          можливе, щоб зовнішній вигляд і якість сирного набору були подібні на
          оригінальну пропозицію.
        </li>
      </ul>
      <h2 className="text-2xl text-text_com font-semibold mb-4">
        Як видалити акаунт?
      </h2>
      <ul className="list-decimal mb-8 pl-6 text-lg  leading-6 text-text_com">
        <li>Увійдіть до особистого кабінету, ввівши логін і пароль.</li>
        <li>Виберіть розділ Особисті дані</li>
        <li>Гортайте сторінку донизу.</li>
        <li>Виберіть Видалити акаунт назавжди.</li>
        <li>
          Поставте галку про згоду з видаленням історії та іншими наслідками
          видалення облікового запису.
        </li>
        <li>За бажанням вкажіть причину видалення.</li>
        <li>Натисніть Видалити мій акаунт.</li>
        <li>
          При видаленні акаунту, ми призупиняємо обробку ваших персональних
          даних, які обробляли на основі вашої згоди з умовами використання
          сайту.
        </li>
      </ul>
    </div>
  );
};
export default RulesPage;
